package superAndSub;

public class SuperAndSubDemo {
    public static void main(String[] args) {
        // Створення об?єкта суперкласу:
        Alpha objA=new Alpha();
        // Присвоєння значення полю об?єкта суперкласу:
        objA.name="alpha";
        // Виклик методу з об?єкта суперкласу:
        objA.show();
        // Створення об?єкта підкласу:
        Bravo objB=new Bravo();
        // Присвоєння значення полям об?єкта підкласу:
        objB.name="bravo";
        objB.code=123;
        // Виклик методу з об?єкта підкласу:
        objB.show();
        // Змінній суперкласу значенням присвоюється
        // посилання на об?єкт підкласу:
        objA=objB;
        // Значення поля об?єкта підкласу змінюється
        // через змінну суперкласу:
        objA.name="charlie";
        // Виклик методу з об?єкта підкласу
        // через змінну суперкласу:
        objA.show();
        // Виклик методу з об?єкта підкласу
        // через змінну підкласу:
        objB.show();
    }
}
